//Вывести на экран все числа от 1 до 100, которые делятся на 3 без остатка.

public class Solution
{
    public static void main(String[] args) throws Exception
    {

        for(int j=3; j<100; j=j+3)
            System.out.println(j);

    }
}
